sonicFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       370;
    }
    sym
    {
        type            patch;
        nFaces          10;
        startFace       380;
    }
    wedge
    {
        type            patch;
        nFaces          10;
        startFace       390;
    }
    top
    {
        type            patch;
        nFaces          20;
        startFace       400;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       420;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       620;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       820;
    }
)

// ************************************************************************* //
